app/controllers/activities_controller.rb

  def index
    @activities = Activity.all
---
SELECT "activities".* FROM "activities"

  def set_activity
    @activity = Activity.find(params[:id])
---
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]