app/views/activities/new.html.erb

      <div class="form-group col-md-6">
      <%= f.collection_select :country_id, Country.all, :id, :name, :class => "form-control text-dark"%>
---
SELECT "countries".* FROM "countries"